     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A          R REC
     A            FLDA          10A  H
     A            FLDB          10A  B  8  2
