     A                                      DSPSIZ(24 80 *DS3)
     A          R HEAD
     A                                  1  2'GRID TEST'
     A          R LINES                     GRDRCD
     A                                      GRDLIN((*POS (6 10 31)) (*TYPE-
     A                                       LOWER))
     A                                      GRDBOX((*POS (15 2 4 19)) (*TYPE-
     A                                       PLAIN) (*COLOR RED))
     A                                      GRDLIN((*POS (3 60 10)) (*TYPE-
     A                                       RIGHT) (*LINTYP DBL))
     A                                      GRDBOX((*POS (4 2 3 30)) (*TYPE-
     A                                       HRZVRT 1 10) (*LINTYP DSH))
