     A                                      DSPSIZ(24 80 *DS3)
     A          R HEAD
     A                                  1  2'GRID TEST'
     A          R LINES                     GRDRCD
     A                                      GRDBOX((*POS (2 2 3 10)) (*TYPE BOGUS))
