     A* 顧客一覧（印刷装置ファイル） SPACE/SKIP を使う様式では行番号を書かない
     A                                      REF(CUSTMST)
     A          R HEADING                   SKIPB(1)
     A                                      SPACEA(2)
     A                                    30'顧客一覧表'
     A          R DETLINE                   SPACEA(1)
     A            CUSTNO    R              5
     A            CUSTNM    R             15
     A            CUSTAM    R             50EDTCDE(1)
