     A* 顧客マスター（物理ファイル） F4 とルーラーの確認用
     A          R CUSTREC                   TEXT('顧客マスター')
     A            CUSTNO         5S 0       COLHDG('顧客' '番号')
     A            CUSTNM        30A         COLHDG('顧客名')
     A            CUSTKN        30O         COLHDG('カナ名')
     A            CUSTAM         9S 2       COLHDG('売上金額')
     A            UPDDAT         8S 0       COLHDG('更新日')
     A          K CUSTNO
