     A* 顧客マスター（論理ファイル） 選択/省略とキーの確認用
     A          R CUSTREC                   PFILE(CUSTMST)
     A            CUSTNO
     A            CUSTNM
     A            CUSTAM
     A          K CUSTNM
     A          S CUSTAM                    COMP(GT 0)
