     H
     FCUSTMAS  IF  E           K        DISK
     FPRINT    O   F     132     OF     PRINTER
     ICUSTMAS  NS  01
     C                     MOVEL*BLANKS   NAME
     C           CUSTNO    CHAINCUSTMAS              99
     C                     Z-ADD0         TOTAL 6
     C                     EXSR CALC
     C           CALC      BEGSR
     C           AMOUNT    ADD  TAX       TOTAL
     C                     ENDSR
     OPRINT    D    1
     O                             NAME      30
