     FPRTTST    O    E             PRINTER
     C                   WRITE     P1
     C                   WRITE     P2
     C                   WRITE     P2
     C                   WRITE     P3
     C                   SETON                                            LR
