     A          R PHEAD                     SKIPB(3)
     A                                     2'ADDTEST'
     A          R PDETL                     SPACEA(1)
     A            CUSTNO         6A        2
     A                                    20'END'
