     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R WIN01                     WINDOW(8 20 9 44)
     A                                      WDWTITLE((*TEXT '顧客詳細')-
     A                                       (*COLOR WHT))
     A                                  2  2'CODE'
