     A                                      DSPSIZ(24 80 *DS3)
     A          R EMPMNT                    CA03(03 '終了')
     A                                  1  2'社員マスタ保守'
     A                                  1 65'EMPMNT01'
     A                                  3  2'社員番号'
     A            EMPNO          6S 0B  3 14
     A                                  4  2'氏名'
     A            EMPNAM        20A  B  4 14
     A                                  5  2'所属部門'
     A            DEPTCD         3S 0B  5 14
     A            DEPTNM        20A  O  5 20
     A                                 23  2'F3=終了'
