     A                                      DSPSIZ(24 80 *DS3)
     A          R GA                        CA03(03)
     A                                  1  2'GOLDEN A'
     A                                  3  2'CODE'
     A            FLD1           5A  B  3  8
     A                                  5  2'名前'
     A            FLD2           8A  O  5  9
     A                                  7  2'社員マスタ保守'
     A            FLD3           4S 0O  7 20
     A                                 23  2'F3=EXIT'
