     A*  このファイルはパーサの耐性テスト用（コメント行）
     A                                      DSPSIZ(24 80 *DS3)

     A          R MESSY
     A*
     A 50                               6  2'CONDITIONED'
     A            FLD1          10A  O  6 20DSPATR(HI) CHECK(LC) +
     A                                        DSPATR(UL)
     A            FLD2          10A  O  7 20                 
     A?? 不正な form type の行（opaque として素通しされるべき）
     A            FLD3           5A  O  8 20