     A                                      DSPSIZ(24 80 *DS3)
     A          R MAIN
     A                                  1  2'GRIDTST3'
     A                                  2  2'Press Enter'
     A          R GRD3                      GRDRCD
     A                                      GRDBOX((*POS (4 3 4 20)) (*TYPE +
     A                                      PLAIN) (*COLOR RED) (*LINTYP SLD))
     A                                      GRDBOX((*POS (4 26 4 20)) (*TYPE +
     A                                      PLAIN) (*COLOR YLW) (*LINTYP DSH))
     A                                      GRDBOX((*POS (4 49 4 20)) (*TYPE +
     A                                      PLAIN) (*COLOR WHT) (*LINTYP DOT))
     A                                      GRDBOX((*POS (10 3 6 30)) (*TYPE +
     A                                      HRZ 2) (*COLOR GRN))
     A                                      GRDBOX((*POS (10 40 6 30)) (*TYPE +
     A                                      VRT 5) (*COLOR BLU))
     A          R WIN1                      WINDOW(18 20 4 36)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR +
     A                                      RI) (*CHAR '        '))
     A                                  2  3'REVERSE IMAGE BORDER'
     A          R GRD4                      GRDRCD
     A                                      GRDATR((*COLOR WHT) (*LINTYP SLD))
     A                                      GRDLIN((*POS (4 3 40)) (*TYPE +
     A                                      UPPER 3 2))
     A                                      GRDLIN((*POS (14 3 8)) (*TYPE LEFT +
     A                                      4 6))
     A          R WIN2                      WINDOW(16 20 5 40)
     A                                      WDWBORDER((*COLOR GRN) (*CHAR +
     A                                      '+-+||+-+'))
     A                                      WDWTITLE((*TEXT 'CHAR BORDER') +
     A                                      (*COLOR YLW))
     A                                  2  3'EXPLICIT BORDER CHARS'
     A          R BACKGND
     A                                  1  2'BG01'
     A                                  1 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  2  2'BG02'
     A                                  2 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  3  2'BG03'
     A                                  3 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  4  2'BG04'
     A                                  4 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  5  2'BG05'
     A                                  5 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  6  2'BG06'
     A                                  6 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  7  2'BG07'
     A                                  7 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  8  2'BG08'
     A                                  8 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                  9  2'BG09'
     A                                  9 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 10  2'BG10'
     A                                 10 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 11  2'BG11'
     A                                 11 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 12  2'BG12'
     A                                 12 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 13  2'BG13'
     A                                 13 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 14  2'BG14'
     A                                 14 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 15  2'BG15'
     A                                 15 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 16  2'BG16'
     A                                 16 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 17  2'BG17'
     A                                 17 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 18  2'BG18'
     A                                 18 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 19  2'BG19'
     A                                 19 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 20  2'BG20'
     A                                 20 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 21  2'BG21'
     A                                 21 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A                                 22  2'BG22'
     A                                 22 20'BACKGROUND-BACKGROUND-BACKGROUND'
     A          R WINBG                     WINDOW(8 25 8 30)
     A                                      WDWBORDER((*COLOR GRN) (*CHAR +
     A                                      '+-+||+-+'))
     A                                  2  3'WINDOW CONTENT'
     A          R WINNOB                    WINDOW(8 25 8 30)
     A                                  1  1'TL'
     A                                  1 29'TR'
     A                                  7  1'BL'
     A                                  7 29'BR'
     A                                  4  9'NO WDWBORDER'
