     D X               S              5P 2
     C                   SETON                                        50
     C   50              EVAL(H)   X = 10 / 3
     C  N50              EVAL      X = 0
     C                   SETON                                        LR
