     DcustomerAccountBalance...
     D                 S             11P 2
     DREC              DS
     D  SUB9                   1      5
     C                   EVAL      customerAccountBalance = 1
     C                   SETON                                        LR
