     A                                      DSPSIZ(24 80 *DS3)
     A          R REC1                      GRDLIN((*POS 3 1 80)(*TYPE UPPER))
     A                                      GRDBOX((*POS 5 5 3 10))
