     A* 描画モデルと実機の画面を突き合わせるための様式。
     A* 生成物なので手で直さない（verify/make-render-fixture.py を直す）。
     A                                      DSPSIZ(24 80 *DS3)
     A          R RENDERR                   CA03(03)
     A                                  2  4'顧客保守'
     A                                  2 20'CUSTOMER MAINT'
     A                                  4  4'コードNO'
     A                                  4 30'区分A'
     A                                  6  4'NAME'
     A            NAME          20A  B  6 12
     A                                  8  4'CODE'
     A            CODE           6S 0I  8 12
     A                                 10  4'AMOUNT'
     A            AMOUNT         9S 2O 10 12
     A                                 12  4'RED' COLOR(RED)
     A                                 12 12'REVERSE' DSPATR(RI)
     A                                 12 24'UNDER' DSPATR(UL)
     A                                 12 34'WHITE' COLOR(WHT)
     A                                 14  4'HIDE' DSPATR(ND)
     A                                 14 12'全角赤' COLOR(RED)
     A                                 18  4'RATE'
     A            RATE           6Y 2B 18 12
     A  50                             16  4'COND50'
     A                                 22 74'EDGE'
     A                                 24  4'F3=EXIT'
