     A                                      DSPSIZ(24 80 *DS3) INDARA
     A                                      CA03(03 '終了') CA12(12 '取消')
     A                                      PRINT
     A          R HEADER
     A                                  1  2'CMPLXR'
     A            DSPDATE        6Y 0O  1 70EDTCDE(Y)
     A                                  1 28'顧客照会（サブファイル）'
     A                                      COLOR(WHT) DSPATR(HI RI)
     A            DSPTIME        6Y 0O  2 70EDTWRD('  :  :  ')
     A          R SFL01                     SFL
     A            OPT            1A  B  7  3VALUES(' ' '1' '5') DSPATR(UL)
     A            CUSNO          7Y 0O  7  7EDTCDE(Z)
     A            CUSNM         30O  O  7 17
     A            BAL           11Y 2O  7 50EDTCDE(J)
     A            STS            4A  O  7 68
     A  40                                  COLOR(RED) DSPATR(RI)
     A            CUSKEY         7S 0H
     A          R SFCTL01                   SFLCTL(SFL01)
     A                                      SFLSIZ(0050) SFLPAG(0012)
     A                                      OVERLAY
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  33                                  SFLCLR
     A  34                                  SFLEND(*MORE)
     A                                  3  2'検索（顧客名）：'
     A            SRCH          20O  B  3 22DSPATR(UL) CHECK(LC)
     A                                  4  2'1=選択 5=表示' COLOR(BLU)
     A                                  6  2'OP' DSPATR(UL) COLOR(WHT)
     A                                  6  7'番号' DSPATR(UL) COLOR(WHT)
     A                                  6 17'顧客名' DSPATR(UL) COLOR(WHT)
     A                                  6 50'残高' DSPATR(UL) COLOR(WHT)
     A                                  6 68'状態' DSPATR(UL) COLOR(WHT)
     A            RRN1           4S 0H      SFLRCDNBR(CURSOR)
     A                                  5  2'───────────────'
     A                                  5 40'───────────────'
     A          R FOOTER                    OVERLAY
     A                                 23  2'F3=終了 F12=取消' COLOR(BLU)
     A            MSG           70A  O 24  2COLOR(RED) DSPATR(HI)
     A  90                             22  2'入力に誤りがあります' COLOR(RED)
     A                                      DSPATR(BL)
     A          R WIN01                     WINDOW(8 20 9 44)
     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI))
     A                                      WDWTITLE((*TEXT '顧客詳細') (*COL-
     A                                      OR WHT))
     A                                  2  2'コード：'
     A            WCUSNO         7Y 0O  2 14
     A                                  4  2'顧客名：'
     A            WCUSNM        30O  O  4 14
     A                                  6  2'残高：'
     A            WBAL          11Y 2O  6 14EDTCDE(J) COLOR(YLW)
     A                                  8  2'F12=戻る' COLOR(BLU)
     A          R GRID01                    GRDRCD
     A                                      GRDATR((*COLOR BLU) (*LINTYP SLD))
     A                                      GRDBOX((*POS (5 1 18 80)) (*TYPE PL-
     A                                      AIN))
     A                                      GRDLIN((*POS (6 2 78)) (*TYPE UPPER-
     A                                      ))
