     A          R PHEAD                     SKIPB(3)
     A                                     2'CMPLXP'
     A                                    50'顧客残高一覧表' HIGHLIGHT
     A                                      UNDERLINE
     A            PDATE          6S 0    100EDTCDE(Y)
     A                                   115'頁'
     A            PPAGE          4S 0    120EDTCDE(Z)
     A          R PCOLH                     SPACEB(2)
     A                                     2'番号' UNDERLINE
     A                                    12'顧客名' UNDERLINE
     A                                    52'残高' UNDERLINE
     A                                    70'状態' UNDERLINE
     A          R PRULE                     SPACEB(1)
     A                                     2'----------------------------------'
     A                                    37'----------------------------------'
     A          R PDETL                     SPACEB(1)
     A            PCUSNO         7S 0      2EDTCDE(Z)
     A            PCUSNM        30O       12
     A            PBAL          11S 2     46EDTCDE(J)
     A            PSTS           4A       70
     A          R PTOTL                     SPACEB(2)
     A                                     2'件数'
     A            PCNT           5S 0      8EDTCDE(Z)
     A                                    30'合計'
     A            PTOTAL        13S 2     42EDTCDE(J) HIGHLIGHT
