     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R REC
     A                                  1  2'Search: customer name'
     A                                  2  2'顧客名で絞り込みます（部分一致）'
     A                                  3  2'Mixed' COLOR(WHT)
