     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R REC
     A                                  3  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                  5  2'────────────────-
     A                                      ────────────────-
     A                                      ──────'
     A                                  7  2'FOLDTEST END'
