     A          R PREC                      SPACEB(1)
     A                                     1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A          R PREC2                     SPACEB(1)
     A                                     2'────────────────-
     A                                      ────────────────-
     A                                      ──────'
