     FFOLDD     CF   E             WORKSTN
     C                   EXFMT     REC
     C                   SETON                                        LR
