     FFOLDP     O    E             PRINTER
     C                   WRITE     PREC
     C                   WRITE     PREC2
     C                   SETON                                        LR
