     H DATFMT(*ISO) DFTACTGRP(*NO) ACTGRP('HSPECTEST') BNDDIR('QC2LE')
     H COPYRIGHT('(C) 2026 EXAMPLE CORPORATION')
     D today           S               D   INZ(*SYS)
     C                   SETON                                        LR
