     A                                      DSPSIZ(24 80 *DS3)
     A          R REC
     A                                  1  2DATE
     A                                  2  2DATE EDTCDE(Y)
     A                                  3  2DATE(*YY)
     A                                  4  2DATE(*YY) EDTCDE(Y)
     A                                  5  2TIME
     A                                  6  2SYSNAME
     A                                  7  2USER
