     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R SFL01                     SFL
     A            F1            10A  O  5  2DSPATR(HI)
     A  40                                  COLOR(RED)
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0010) SFLPAG(0005)
     A  31                                  SFLDSP
     A  32                                  SFLDSPCTL
     A  33                                  SFLCLR
     A  34                                  SFLEND
     A                                  1  2'SUBFILE'
