             PGM
             SNDPGMMSG  MSG('CMPLXPR で印刷エラーが発生しました') +
                        MSGTYPE(*COMP)
             SNDPGMMSG  MSG('It''s done')
             SNDPGMMSG  MSG('印刷装置でエラーが発生したので停止') +
                        MSGTYPE(*COMP)
             ENDPGM
