     D MSG             S             20
     D TEXT            S             20
     C                   MOVEL     '無効'      MSG
     C     '顧客'      CAT       '名前':1    TEXT
     C                   SETON                                        LR
