     D MSG             S             20
     D TEXT            S             20
     C                   MOVEL     '無効'          MSG
     C                   SETON                                        LR
