     A                                      DSPSIZ(24 80 *DS3)
     A                                      CHGINPDFT(CS HI)
     A          R REC
     A            F1            10A  B  2  2DSPATR(HI PC RI)
     A            F2            10A  B  3  2COLOR(BLU)
     A            F3            10A  I  4  2CHECK(ME FE)
     A            F4             5Y 0B  5  2COMP(GT 0)
     A            F5             7Y 0O  6  2EDTCDE(J)
     A            F6              L  B  7  2DATFMT(*ISO)
     A                                  8  2DATE(*SYS *YY)
     A            F7              T  B  9  2TIMFMT(*HMS)
     A                                      TIMSEP(*JOB)
