     A          R PREC
     A            P1            10A        2COLOR(BRN) SPACEA(1)
     A            P2             7S 0      2EDTCDE(Z)
     A                                    20DATE(*JOB)
