     A          R PFREC
     A            K1             5S 0       CHECK(M10)
     A            K2              L         DATFMT(*JIS)
     A            K3             5S 0       EDTCDE(3)
