     A                                      DSPSIZ(24 80 *DS3)
     A          R REC
     A            F1            10A  B  2  2COLOR(PURPLE)
     A            F2            10A  B  3  2DSPATR(ZZ)
