     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R REC
     A  40        AMT            7Y 0B  7 74
     A            NAME          10   B  8  2
