     FP4D       CF   E             WORKSTN
     D DS1             DS
     DF1                       1      5
     DF2                       6     12
     C  N03              Z-ADD     0             AMT                      50
     C   50              SETON                                        40
     C                   EXFMT     REC
     C                   SETON                                        LR
