     D DS1             DS
     D F1                1            5
     D F2                6           12
     C                   SETON                                        LR
