     A          R PHEAD                     SKIPB(3)
     A                                  3  2'CMPLXP'
     A                                  3 50'顧客残高一覧表' HIGHLIGHT
     A                                      UNDERLINE
     A            PDATE          6S 0   3100EDTCDE(Y)
     A                                  3115'頁'
     A            PPAGE          4S 0   3120EDTCDE(Z)
     A          R PCOLH                     SPACEB(2)
     A                                  5  2'番号' UNDERLINE
     A                                  5 12'顧客名' UNDERLINE
     A                                  5 52'残高' UNDERLINE
     A                                  5 70'状態' UNDERLINE
     A          R PRULE                     SPACEB(1)
     A                                  6  2'----------------------------------'
     A                                  6 37'----------------------------------'
     A          R PDETL                     SPACEA(1)
     A            PCUSNO         7S 0   8  2EDTCDE(Z)
     A            PCUSNM        30O     8 12
     A            PBAL          11S 2   8 46EDTCDE(J)
     A            PSTS           4A     8 70
     A          R PTOTL                     SPACEB(2)
     A                                 10  2'件数'
     A            PCNT           5S 0  10  8EDTCDE(Z)
     A                                 10 30'合計'
     A            PTOTAL        13S 2  10 42EDTCDE(J) HIGHLIGHT
