     A                                      DSPSIZ(24 80 *DS3) CA03(03)
     A          R SFL01                     SFL
     A            F1            10A  O  5  2
     A          R CTL01                     SFLCTL(SFL01)
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0005)
     A  31                                  SFLDSP
     A  31                                  SFLDSPCTL
     A  33                                  SFLCLR
     A                                      SFLDLT
     A  33                                  SFLEND
     A                                  1  2'X'
