     A* 帳票
     A                                      INDARA REF(QSYS/QADSPOBJ)
     A          R PREC                      SPACEB(1)
     A                                     2'X'
