     A                                      CPI(15)
     A          R PREC                      SPACEB(1)
     A                                     2'X'
