     A                                      LPI(8)
     A          R PREC                      SPACEB(1)
     A                                     2'X'
